Revit 2025 API
WaveDistributionType Enumeration
 The enumerated type representing the permitted values for the asset property "WaveDistribution" from the "Wave" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum WaveDistributionType
Public Enumeration WaveDistributionType
public enum class WaveDistributionType
type WaveDistributionType
Members
Member name | Value | Description
TwoD | 0
ThreeD | 1
See Also
Reference
Autodesk.Revit.DB.Visual Namespace